app/controllers/admin_controller.rb

  def create
    Standard.create(standard_params)
---
INSERT INTO "standards" ("stand12", "stand13", "stand23", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["stand12", 1], ["stand13", 2], ["stand23", 1], ["created_at", "2015-04-18 15:32:18.246609"], ["updated_at", "2015-04-18 15:32:18.246609"]]