app/controllers/scores_controller.rb

  def create
    post_params.each_pair do |key, value|
      current_user.scores.create({standard:key, score:value})
---
INSERT INTO "scores" ("standard", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["standard", "score11"], ["score", "1"], ["created_at", "2015-04-20 01:21:48.632721"], ["updated_at", "2015-04-20 01:21:48.632721"]]