app/controllers/users_controller.rb

  def create
    if user_params['name'] != ""
      user_params['role'] = user_params['role'].to_i if user_params['role']
    	@user = User.new(user_params)
    	@user.save
---
INSERT INTO "users" ("name", "password_salt", "password_hash", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)